# Multiple Linear Regression

In [2]:
# STEP-1 : LOAD DATASET
import pandas as pd
df = pd.read_csv("csv\car data.csv")
df.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [3]:
# STEP-2 : PRINT SHAPE
df.shape

(301, 9)

In [4]:
# STEP-3: CHECK NULL VALUE
df.isna().sum()

Car_Name         0
Year             0
Selling_Price    0
Present_Price    0
Kms_Driven       0
Fuel_Type        0
Seller_Type      0
Transmission     0
Owner            0
dtype: int64

In [5]:
# STEP-4 DATA PREPROCESSING
df["Age"] = 2025 - df["Year"]
df.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Age
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,11
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,12
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,8
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,14
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,11

In [6]:
df.drop(["Year"],axis=1,inplace=True)
df.head()

,Car_Name,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Age
0,ritz,3.35,5.59,27000,Petrol,Dealer,Manual,0,11
1,sx4,4.75,9.54,43000,Diesel,Dealer,Manual,0,12
2,ciaz,7.25,9.85,6900,Petrol,Dealer,Manual,0,8
3,wagon r,2.85,4.15,5200,Petrol,Dealer,Manual,0,14
4,swift,4.60,6.87,42450,Diesel,Dealer,Manual,0,11

In [7]:
df.drop(["Car_Name"],axis=1,inplace=True)
df.head()

,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Age
0,3.35,5.59,27000,Petrol,Dealer,Manual,0,11
1,4.75,9.54,43000,Diesel,Dealer,Manual,0,12
2,7.25,9.85,6900,Petrol,Dealer,Manual,0,8
3,2.85,4.15,5200,Petrol,Dealer,Manual,0,14
4,4.60,6.87,42450,Diesel,Dealer,Manual,0,11

In [8]:
# STEP-5: DATA PREPERTION
df = pd.get_dummies(data=df,drop_first=True)
df.head()

,Selling_Price,Present_Price,Kms_Driven,Owner,Age,Fuel_Type_Diesel,Fuel_Type_Petrol,Seller_Type_Individual,Transmission_Manual
0,3.35,5.59,27000,0,11,0,1,0,1
1,4.75,9.54,43000,0,12,1,0,0,1
2,7.25,9.85,6900,0,8,0,1,0,1
3,2.85,4.15,5200,0,14,0,1,0,1
4,4.60,6.87,42450,0,11,1,0,0,1

In [9]:
df.columns

Index(['Selling_Price', 'Present_Price', 'Kms_Driven', 'Owner', 'Age',
       'Fuel_Type_Diesel', 'Fuel_Type_Petrol', 'Seller_Type_Individual',
       'Transmission_Manual'],
      dtype='object')

In [10]:
# STEP-6: DEFINE X & Y
Y = df[["Selling_Price"]]

In [11]:
# X = df[["Present_Price","Kms_Driven","Owner","Age","Fuel_Type_Diesel","Fuel_Type_Petrol","Seller_Type_Individual","Transmission_Manual"]]
X = df.drop("Selling_Price",axis=1)
X.head()

,Present_Price,Kms_Driven,Owner,Age,Fuel_Type_Diesel,Fuel_Type_Petrol,Seller_Type_Individual,Transmission_Manual
0,5.59,27000,0,11,0,1,0,1
1,9.54,43000,0,12,1,0,0,1
2,9.85,6900,0,8,0,1,0,1
3,4.15,5200,0,14,0,1,0,1
4,6.87,42450,0,11,1,0,0,1

In [12]:
X.shape

(301, 8)

In [13]:
Y.shape

(301, 1)

In [14]:
# step-7: SPLIT DATA
from sklearn.model_selection import train_test_split
X_train , X_test , Y_train , Y_test = train_test_split(X,Y,test_size=0.2,random_state=1)

In [15]:
print(X_train.shape)
print(X_test.shape)
print(Y_train.shape)
print(Y_test.shape)

(240, 8)
(61, 8)
(240, 1)
(61, 1)

In [16]:
#STEP-8: MODEL SELECTION
from sklearn.linear_model import LinearRegression
lr=LinearRegression()

In [18]:
lr.fit(X_train,Y_train)

LinearRegression()

In [19]:
#STEP-9: FIND M & C
m = lr.coef_
print(m)

[[ 4.37233976e-01 -5.30613944e-06  3.45912849e-01 -4.13270098e-01
   2.23050770e+00  4.58549217e-01 -1.20927814e+00 -1.87014327e+00]]

In [20]:
c = lr.intercept_
print(c)

[7.48703003]

In [21]:
baleno = lr.predict([[9,80000,0,2,0,1,1,1]])
print(baleno)

[[7.55023227]]

In [24]:
# age=5
# km_driven = 1000000
# diseal car
# auto trsmission
# owner = 0 
# present price = 1200000
# delear

demo = lr.predict([[12,100000,0,5,1,0,1,0]])
demo

array([[11.15810286]])

In [26]:
y_pred = lr.predict(X_test)
print(y_pred)

[[ 7.86273200e+00]
 [ 2.96828691e+00]
 [-5.90305107e-01]
 [ 4.21335952e+00]
 [ 4.83175534e-01]
 [ 5.82053813e+00]
 [ 1.95679784e+00]
 [ 2.55809661e+00]
 [ 7.70870833e+00]
 [ 9.78692192e-01]
 [ 8.13484343e+00]
 [ 3.51207180e+00]
 [ 4.90669281e+00]
 [ 4.63905587e+00]
 [-2.15886643e+00]
 [ 3.13874624e+00]
 [ 7.98256903e+00]
 [ 6.75937638e+00]
 [ 6.90426580e+00]
 [ 8.01440587e+00]
 [ 4.31168610e+00]
 [ 4.00336757e+00]
 [ 1.13040883e+01]
 [ 8.07939189e+00]
 [ 9.54399823e+00]
 [ 3.52133877e+00]
 [ 3.80609808e+00]
 [ 1.06074722e+00]
 [-6.01732475e-01]
 [-6.19712043e-01]
 [ 1.32818516e-03]
 [-1.28500691e+00]
 [ 4.28533553e+00]
 [ 2.06769487e+01]
 [ 1.87563232e+01]
 [ 4.27292100e+00]
 [ 3.48602852e+00]
 [ 1.66739677e+00]
 [-4.38707073e-02]
 [ 5.78536030e+00]
 [ 8.03940428e+00]
 [ 9.88367483e+00]
 [ 4.09684249e-01]
 [ 6.07997517e+00]
 [ 5.88038915e+00]
 [ 4.32745252e+00]
 [ 7.37534505e+00]
 [ 5.86171335e+00]
 [ 8.21129880e+00]
 [ 1.65455816e+00]
 [ 3.83033706e+00]
 [ 1.75047060e+00]
 [ 2.51406796e+00]
 [ 4.20404709e+00]
 [ 1.48991546e+00]
 [-3.44185843e+00]
 [ 2.04806215e+01]
 [ 6.62503544e-01]
 [ 5.40027412e+00]
 [ 5.65856241e+00]
 [ 6.47876234e-01]]

In [33]:
from sklearn.metrics import mean_squared_error,mean_absolute_error,r2_score
print("MSE=",mean_squared_error(Y_test, y_pred))
print("MAE=",mean_absolute_error(Y_test, y_pred))
print("RMSE=",mean_squared_error(Y_test,y_pred)**0.5)
print("R2_Score=",r2_score(Y_test, y_pred))
# r2_score value is 1 then ok and value negative then they are woest model

MSE= 2.982384861859748
MAE= 1.0998575552990952
RMSE= 1.726958268708236
MSE= 0.8625260513315253

# Task 1

In [35]:
# STEP-1 : LOAD DATASET
import pandas as pd
df = pd.read_csv("csv\insurance.csv")
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [36]:
# STEP-2 : PRINT SHAPE
df.shape

(1338, 7)

In [37]:
# STEP-3: CHECK NULL VALUE
df.isna().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [38]:
# STEP-5: DATA PREPERTION
df = pd.get_dummies(data=df,drop_first=True)
df.head()

,age,bmi,children,charges,sex_male,smoker_yes,region_northwest,region_southeast,region_southwest
0,19,27.900,0,16884.92400,0,1,0,0,1
1,18,33.770,1,1725.55230,1,0,0,1,0
2,28,33.000,3,4449.46200,1,0,0,1,0
3,33,22.705,0,21984.47061,1,0,1,0,0
4,32,28.880,0,3866.85520,1,0,1,0,0

In [39]:
df.columns

Index(['age', 'bmi', 'children', 'charges', 'sex_male', 'smoker_yes',
       'region_northwest', 'region_southeast', 'region_southwest'],
      dtype='object')

In [40]:
# STEP-6: DEFINE X & Y
y = df[["charges"]]

In [41]:
# X = df[["Present_Price","Kms_Driven","Owner","Age","Fuel_Type_Diesel","Fuel_Type_Petrol","Seller_Type_Individual","Transmission_Manual"]]
x = df.drop("charges",axis=1)
x.head()

,age,bmi,children,sex_male,smoker_yes,region_northwest,region_southeast,region_southwest
0,19,27.900,0,0,1,0,0,1
1,18,33.770,1,1,0,0,1,0
2,28,33.000,3,1,0,0,1,0
3,33,22.705,0,1,0,1,0,0
4,32,28.880,0,1,0,1,0,0

In [42]:
# step-7: SPLIT DATA
from sklearn.model_selection import train_test_split
x_train , x_test , y_train , y_test = train_test_split(x,y,test_size=0.2,random_state=1)

In [43]:
print(x_train.shape)
print(x_test.shape)
print(y_train.shape)
print(y_test.shape)

(1070, 8)
(268, 8)
(1070, 1)
(268, 1)

In [44]:
#STEP-8: MODEL SELECTION
from sklearn.linear_model import LinearRegression
lr=LinearRegression()

In [45]:
lr.fit(x_train,y_train)

LinearRegression()

In [46]:
#STEP-9: FIND M & C
m = lr.coef_
print(m)

[[  257.49024669   321.62189278   408.06102001  -242.15306559
  23786.48604536  -396.09656355 -1038.37587965  -903.03300778]]

In [47]:
c = lr.intercept_
print(c)

[-11297.61000854]

In [50]:
charge = lr.predict([[25,30,2,0,1,1,0,0]])
print(charge)

[[28994.81446393]]

In [52]:
y_pred = lr.predict(x_test)
# print(y_pred)

In [54]:
from sklearn.metrics import mean_squared_error,mean_absolute_error,r2_score
print("MSE=",mean_squared_error(y_test, y_pred))
print("MAE=",mean_absolute_error(y_test, y_pred))
print("RMSE=",mean_squared_error(y_test,y_pred)**0.5)
print("R2_Score=",r2_score(y_test, y_pred))

MSE= 35479352.80730364
MAE= 4051.8587667470442
RMSE= 5956.454717976427
R2_Score= 0.7623311844057112

# QB-206

In [56]:
# STEP-1 : LOAD DATASET
import pandas as pd
df = pd.read_csv("Real estate.csv")
df.head()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
0,1,2012.917,32.0,84.87882,10,24.98298,121.54024,37.9
1,2,2012.917,19.5,306.59470,9,24.98034,121.53951,42.2
2,3,2013.583,13.3,561.98450,5,24.98746,121.54391,47.3
3,4,2013.500,13.3,561.98450,5,24.98746,121.54391,54.8
4,5,2012.833,5.0,390.56840,5,24.97937,121.54245,43.1

In [57]:
# STEP-2 : PRINT SHAPE
df.shape

(414, 8)

In [58]:
# STEP-3: CHECK NULL VALUE
df.isna().sum()

No                                        0
X1 transaction date                       0
X2 house age                              0
X3 distance to the nearest MRT station    0
X4 number of convenience stores           0
X5 latitude                               0
X6 longitude                              0
Y house price of unit area                0
dtype: int64

In [62]:
df.drop(["No"],axis=1,inplace=True)

In [63]:
# STEP-5: DATA PREPERTION
df = pd.get_dummies(data=df,drop_first=True)
df.head()

,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
0,2012.917,32.0,84.87882,10,24.98298,121.54024,37.9
1,2012.917,19.5,306.59470,9,24.98034,121.53951,42.2
2,2013.583,13.3,561.98450,5,24.98746,121.54391,47.3
3,2013.500,13.3,561.98450,5,24.98746,121.54391,54.8
4,2012.833,5.0,390.56840,5,24.97937,121.54245,43.1

In [64]:
df.columns

Index(['X1 transaction date', 'X2 house age',
       'X3 distance to the nearest MRT station',
       'X4 number of convenience stores', 'X5 latitude', 'X6 longitude',
       'Y house price of unit area'],
      dtype='object')

In [65]:
# STEP-6: DEFINE X & Y
y = df[["Y house price of unit area"]]

In [67]:
# X = df[["Present_Price","Kms_Driven","Owner","Age","Fuel_Type_Diesel","Fuel_Type_Petrol","Seller_Type_Individual","Transmission_Manual"]]
x = df.drop("Y house price of unit area",axis=1)
x.head()

,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude
0,2012.917,32.0,84.87882,10,24.98298,121.54024
1,2012.917,19.5,306.59470,9,24.98034,121.53951
2,2013.583,13.3,561.98450,5,24.98746,121.54391
3,2013.500,13.3,561.98450,5,24.98746,121.54391
4,2012.833,5.0,390.56840,5,24.97937,121.54245

In [68]:
# step-7: SPLIT DATA
from sklearn.model_selection import train_test_split
x_train , x_test , y_train , y_test = train_test_split(x,y,test_size=0.3,random_state=110)

In [69]:
print(x_train.shape)
print(x_test.shape)
print(y_train.shape)
print(y_test.shape)

(289, 6)
(125, 6)
(289, 1)
(125, 1)

In [70]:
#STEP-8: MODEL SELECTION
from sklearn.linear_model import LinearRegression
lr=LinearRegression()

In [71]:
lr.fit(x_train,y_train)

LinearRegression()

In [72]:
#STEP-9: FIND M & C
m = lr.coef_
print(m)

[[ 6.84308941e+00 -2.25466590e-01 -5.18046265e-03  1.12369103e+00
   1.87739728e+02 -4.29300312e+01]]

In [73]:
c = lr.intercept_
print(c)

[-13203.67430062]

In [74]:
y_pred = lr.predict(x_test)
# print(y_pred)

In [75]:
from sklearn.metrics import mean_squared_error,mean_absolute_error,r2_score
print("MSE=",mean_squared_error(y_test, y_pred))
print("MAE=",mean_absolute_error(y_test, y_pred))
print("RMSE=",mean_squared_error(y_test,y_pred)**0.5)
print("R2_Score=",r2_score(y_test, y_pred))

MSE= 77.14802598253955
MAE= 6.443245493782469
RMSE= 8.78339490075105
R2_Score= 0.5447865064578615